//HOMMET01 JOB (ACCT),'MILAN JOB',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//STEP01    EXEC PGM=CALCULS
//STEPLIB   DD DSN=MON.LOAD.LIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSIN     DD DUMMY
